# Ultralytics YOLO11 object detection model with GCBlock after P2/P3/P4/P5 backbone C3k2.
#
# GCBlock inserted after all P2, P3, P4, P5 C3k2 layers.
# All head concat layer indices adjusted to match new backbone layer numbers.
nc: 5
scales:
  # [depth, width, max_channels]
  n: [0.50, 0.25, 1024]
  s: [0.50, 0.50, 1024]
  m: [0.50, 1.00, 512]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.50, 512]

backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]] # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]] # 1-P2/4
  - [-1, 2, C3k2, [256, False, 0.25]] # 2-P2/4 output
  - [-1, 1, GCBlock, [256]] # 3 GC-P2 新增
  - [-1, 1, Conv, [256, 3, 2]] # 4-P3/8
  - [-1, 2, C3k2, [512, False, 0.25]] # 5-P3/8 output
  - [-1, 1, GCBlock, [512]] # 6 GC-P3
  - [-1, 1, Conv, [512, 3, 2]] # 7-P4/16
  - [-1, 2, C3k2, [512, True]] # 8-P4/16 output
  - [-1, 1, GCBlock, [512]] # 9 GC-P4
  - [-1, 1, Conv, [1024, 3, 2]] # 10-P5/32
  - [-1, 2, C3k2, [1024, True]] # 11-P5/32 output
  - [-1, 1, GCBlock, [1024]] # 12 GC-P5 新增
  - [-1, 1, SPPF, [1024, 5]] # 13
  - [-1, 2, C2PSA, [1024]] # 14

head:
  # P5 -> P4 top-down FPN
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 9], 1, Concat, [1]] # cat GC-enhanced P4 (原索引8 → 9)
  - [-1, 2, C3k2, [512, False]] # 15

  # P4 -> P3 top-down FPN
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 6], 1, Concat, [1]] # cat GC-enhanced P3 (原索引5 → 6)
  - [-1, 2, C3k2, [256, False]] # 18 (P3/8-small)

  # P3 -> P4 bottom-up PAN
  - [-1, 1, Conv, [256, 3, 2]]
  - [[-1, 15], 1, Concat, [1]]
  - [-1, 2, C3k2, [512, False]] # 21 (P4/16-medium)

  # P4 -> P5 bottom-up PAN
  - [-1, 1, Conv, [512, 3, 2]]
  - [[-1, 14], 1, Concat, [1]] # cat final backbone C2PSA (原索引12 → 14)
  - [-1, 2, C3k2, [1024, True]] # 24 (P5/32-large)

  - [[18, 21, 24], 1, Detect, [nc]] # Detect(P3, P4, P5)