# Ultralytics YOLO11 object detection model with AFPN-lite neck.
#
# This variant keeps the YOLO11 backbone and Detect head type unchanged.
# Only the neck is changed: normal Concat fusion is replaced with progressive
# adjacent-scale adaptive fusion blocks inspired by AFPN.

nc: 5
scales:
  # [depth, width, max_channels]
  n: [0.50, 0.25, 1024]
  s: [0.50, 0.50, 1024]
  m: [0.50, 1.00, 512]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.50, 512]

backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]] # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]] # 1-P2/4
  - [-1, 2, C3k2, [256, False, 0.25]] # 2
  - [-1, 1, Conv, [256, 3, 2]] # 3-P3/8
  - [-1, 2, C3k2, [512, False, 0.25]] # 4-P3/8
  - [-1, 1, Conv, [512, 3, 2]] # 5-P4/16
  - [-1, 2, C3k2, [512, True]] # 6-P4/16
  - [-1, 1, Conv, [1024, 3, 2]] # 7-P5/32
  - [-1, 2, C3k2, [1024, True]] # 8-P5/32
  - [-1, 1, SPPF, [1024, 5]] # 9
  - [-1, 2, C2PSA, [1024]] # 10

head:
  # Progressive top-down fusion: P5 -> P4
  - [10, 1, nn.Upsample, [None, 2, "nearest"]] # 11
  - [[-1, 6], 1, AFPNFuse2, [512, 8]] # 12, adaptive fuse P5 and P4
  - [-1, 2, C3k2, [512, False]] # 13, P4 top-down

  # Progressive top-down fusion: P4 -> P3
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] # 14
  - [[-1, 4], 1, AFPNFuse2, [256, 8]] # 15, adaptive fuse P4 and P3
  - [-1, 2, C3k2, [256, False]] # 16, P3/8-small

  # Progressive bottom-up fusion: P3 -> P4
  - [-1, 1, Conv, [256, 3, 2]] # 17
  - [[-1, 13], 1, AFPNFuse2, [512, 8]] # 18, adaptive fuse P3 and P4
  - [-1, 2, C3k2, [512, False]] # 19, P4/16-medium

  # Progressive bottom-up fusion: P4 -> P5
  - [-1, 1, Conv, [512, 3, 2]] # 20
  - [[-1, 10], 1, AFPNFuse2, [1024, 8]] # 21, adaptive fuse P4 and P5
  - [-1, 2, C3k2, [1024, True]] # 22, P5/32-large

  - [[16, 19, 22], 1, Detect, [nc]] # Detect(P3, P4, P5)
