# YOLOv11n + GCBlock(P2/P3/P4/P5) + FeaturePyramidSharedConvLite P4-only Neck

nc: 5
scales:
  # [depth, width, max_channels]
  n: [0.50, 0.25, 1024]
  s: [0.50, 0.50, 1024]
  m: [0.50, 1.00, 512]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.50, 512]

backbone:
  - [-1, 1, Conv, [64, 3, 2]] # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]] # 1-P2/4
  - [-1, 2, C3k2, [256, False, 0.25]] # 2-P2/4
  - [-1, 1, GCBlock, [256]] # 3-GC-P2
  - [-1, 1, Conv, [256, 3, 2]] # 4-P3/8
  - [-1, 2, C3k2, [512, False, 0.25]] # 5-P3/8
  - [-1, 1, GCBlock, [512]] # 6-GC-P3
  - [-1, 1, Conv, [512, 3, 2]] # 7-P4/16
  - [-1, 2, C3k2, [512, True]] # 8-P4/16
  - [-1, 1, GCBlock, [512]] # 9-GC-P4
  - [-1, 1, Conv, [1024, 3, 2]] # 10-P5/32
  - [-1, 2, C3k2, [1024, True]] # 11
  - [-1, 1, GCBlock, [1024]] # 12-GC-P5
  - [-1, 1, SPPF, [1024, 5]] # 13
  - [-1, 2, C2PSA, [1024]] # 14-P5/32

head:
  # P5 -> P4: original top-down fusion
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 9], 1, Concat, [1]]
  - [-1, 2, C3k2, [512, False]] # 17

  # P4 -> P3: original top-down fusion
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 6], 1, Concat, [1]]
  - [-1, 2, C3k2, [256, False]] # 20 (P3/8-small)

  # P3 -> P4: shared-conv lightweight P4 fusion
  - [-1, 1, Conv, [256, 3, 2]]
  - [[-1, 17], 1, Concat, [1]]
  - [-1, 1, FeaturePyramidSharedConvLite, [512, 2, 1.0]] # 23 (P4/16-medium)

  # P4 -> P5: original bottom-up fusion to protect high-level semantics
  - [-1, 1, Conv, [512, 3, 2]]
  - [[-1, 14], 1, Concat, [1]]
  - [-1, 2, C3k2, [1024, True]] # 26 (P5/32-large)

  - [[20, 23, 26], 1, Detect, [nc]]
