# Ultralytics YOLO11 object detection model with P4-only LineRefineLite neck ablation.
#
# WasteSortingv3 candidate:
# - Keeps the original YOLO11n backbone, top-down FPN, bottom-up PAN, and Detect head.
# - Adds a zero-initialized residual refinement only on the final P4 detect feature.
# - P5 is built from the original P4 feature, not the refined P4 feature.

nc: 5
scales:
  # [depth, width, max_channels]
  n: [0.50, 0.25, 1024]
  s: [0.50, 0.50, 1024]
  m: [0.50, 1.00, 512]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.50, 512]

backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]] # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]] # 1-P2/4
  - [-1, 2, C3k2, [256, False, 0.25]]
  - [-1, 1, Conv, [256, 3, 2]] # 3-P3/8
  - [-1, 2, C3k2, [512, False, 0.25]]
  - [-1, 1, Conv, [512, 3, 2]] # 5-P4/16
  - [-1, 2, C3k2, [512, True]]
  - [-1, 1, Conv, [1024, 3, 2]] # 7-P5/32
  - [-1, 2, C3k2, [1024, True]]
  - [-1, 1, SPPF, [1024, 5]] # 9
  - [-1, 2, C2PSA, [1024]] # 10

head:
  # P5 -> P4: original
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 6], 1, Concat, [1]]
  - [-1, 2, C3k2, [512, False]] # 13

  # P4 -> P3: original, protects weak P3 boundaries
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 4], 1, Concat, [1]]
  - [-1, 2, C3k2, [256, False]] # 16 (P3/8-small)

  # P3 -> P4: original
  - [-1, 1, Conv, [256, 3, 2]]
  - [[-1, 13], 1, Concat, [1]]
  - [-1, 2, C3k2, [512, False]] # 19 (P4/16-medium)

  # Refine only the P4 feature used by Detect.
  - [-1, 1, LineRefineLite, [9, 8, 0.2, 0.0]] # 20

  # P4 -> P5: original path from unrefined P4
  - [19, 1, Conv, [512, 3, 2]]
  - [[-1, 10], 1, Concat, [1]]
  - [-1, 2, C3k2, [1024, True]] # 23 (P5/32-large)

  - [[16, 20, 23], 1, Detect, [nc]] # Detect(P3, refined P4, P5)
