# Ultralytics YOLO11 object detection model with StripEnhance neck ablation.
#
# WasteSortingv3 neck-only candidate:
# - Keeps the plain YOLO11n backbone, no GCBlock fusion.
# - Keeps original upsampling, downsampling, C3k2 fusion, and Detect head.
# - Inserts residual StripEnhance only after P4 and P3 neck fusion.
# - Designed as a standalone ablation for Reinforcement-friendly line structure enhancement.

nc: 5
scales:
  # [depth, width, max_channels]
  n: [0.50, 0.25, 1024]
  s: [0.50, 0.50, 1024]
  m: [0.50, 1.00, 512]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.50, 512]

backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]] # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]] # 1-P2/4
  - [-1, 2, C3k2, [256, False, 0.25]]
  - [-1, 1, Conv, [256, 3, 2]] # 3-P3/8
  - [-1, 2, C3k2, [512, False, 0.25]]
  - [-1, 1, Conv, [512, 3, 2]] # 5-P4/16
  - [-1, 2, C3k2, [512, True]]
  - [-1, 1, Conv, [1024, 3, 2]] # 7-P5/32
  - [-1, 2, C3k2, [1024, True]]
  - [-1, 1, SPPF, [1024, 5]] # 9
  - [-1, 2, C2PSA, [1024]] # 10

head:
  # P5 -> P4
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 6], 1, Concat, [1]] # cat backbone P4
  - [-1, 2, C3k2, [512, False]] # 13, P4 top-down
  - [-1, 1, StripEnhance, [7, 4, 0.0]] # 14, line-aware P4 residual enhancement

  # P4 -> P3
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 4], 1, Concat, [1]] # cat backbone P3
  - [-1, 2, C3k2, [256, False]] # 17, P3/8-small
  - [-1, 1, StripEnhance, [7, 4, 0.0]] # 18, line-aware P3 residual enhancement

  # P3 -> P4
  - [-1, 1, Conv, [256, 3, 2]]
  - [[-1, 14], 1, Concat, [1]] # cat enhanced head P4
  - [-1, 2, C3k2, [512, False]] # 21, P4/16-medium

  # P4 -> P5
  - [-1, 1, Conv, [512, 3, 2]]
  - [[-1, 10], 1, Concat, [1]] # cat head P5
  - [-1, 2, C3k2, [1024, True]] # 24, P5/32-large

  - [[18, 21, 24], 1, Detect, [nc]] # Detect(P3, P4, P5)
