# Ultralytics YOLO11 object detection model with C3k2_DSConv backbone and ResCBAM neck.
#
# Backbone:
#   - Replace C3k2 with C3k2_DSConv at P3/P4/P5.
#
# Neck:
#   - Add ResCBAM on P3/P4/P5 detection features.

nc: 5
scales:
  # [depth, width, max_channels]
  n: [0.50, 0.25, 1024]
  s: [0.50, 0.50, 1024]
  m: [0.50, 1.00, 512]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.50, 512]

backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]] # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]] # 1-P2/4
  - [-1, 2, C3k2, [256, False, 0.25]] # 2
  - [-1, 1, Conv, [256, 3, 2]] # 3-P3/8
  - [-1, 2, C3k2_DSConv, [512, False, 0.25]] # 4, DSConv-P3
  - [-1, 1, Conv, [512, 3, 2]] # 5-P4/16
  - [-1, 2, C3k2_DSConv, [512, True]] # 6, DSConv-P4
  - [-1, 1, Conv, [1024, 3, 2]] # 7-P5/32
  - [-1, 2, C3k2_DSConv, [1024, True]] # 8, DSConv-P5
  - [-1, 1, SPPF, [1024, 5]] # 9
  - [-1, 2, C2PSA, [1024]] # 10

head:
  # P5 -> P4
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] # 11
  - [[-1, 6], 1, Concat, [1]] # 12, cat backbone P4
  - [-1, 2, C3k2, [512, False]] # 13

  # P4 -> P3
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] # 14
  - [[-1, 4], 1, Concat, [1]] # 15, cat backbone P3
  - [-1, 2, C3k2, [256, False]] # 16, P3/8-small
  - [-1, 1, ResCBAM, [256]] # 17, ResCBAM-P3

  # P3 -> P4
  - [-1, 1, Conv, [256, 3, 2]] # 18
  - [[-1, 13], 1, Concat, [1]] # 19, cat head P4
  - [-1, 2, C3k2, [512, False]] # 20, P4/16-medium
  - [-1, 1, ResCBAM, [512]] # 21, ResCBAM-P4

  # P4 -> P5
  - [-1, 1, Conv, [512, 3, 2]] # 22
  - [[-1, 10], 1, Concat, [1]] # 23, cat backbone P5
  - [-1, 2, C3k2, [1024, True]] # 24, P5/32-large
  - [-1, 1, ResCBAM, [1024]] # 25, ResCBAM-P5

  # Detect
  - [[17, 21, 25], 1, Detect, [nc]] # Detect(ResCBAM-P3, ResCBAM-P4, ResCBAM-P5)