# Ultralytics YOLO11 object detection model with C3k2_DSConv(P3/P4) backbone and ResCBAM(P3/P4) neck.
#
# Backbone:
# - C3k2_DSConv is used only in P3/P4 to enhance elongated local structures.
# - P5 remains original to avoid excessive high-level feature disturbance.
#
# Neck:
# - ResCBAM is applied only on P3/P4 detection features.
# - P5 remains original for stable large-object semantic representation.

nc: 5
scales:
  # [depth, width, max_channels]
  n: [0.50, 0.25, 1024]
  s: [0.50, 0.50, 1024]
  m: [0.50, 1.00, 512]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.50, 512]

backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]] # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]] # 1-P2/4
  - [-1, 2, C3k2, [256, False, 0.25]]
  - [-1, 1, Conv, [256, 3, 2]] # 3-P3/8
  - [-1, 2, C3k2_DSConv, [512, False, 0.25]] # 4, DSConv-P3
  - [-1, 1, Conv, [512, 3, 2]] # 5-P4/16
  - [-1, 2, C3k2_DSConv, [512, True]] # 6, DSConv-P4
  - [-1, 1, Conv, [1024, 3, 2]] # 7-P5/32
  - [-1, 2, C3k2, [1024, True]] # 8, original P5
  - [-1, 1, SPPF, [1024, 5]] # 9
  - [-1, 2, C2PSA, [1024]] # 10

head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 6], 1, Concat, [1]] # cat backbone P4
  - [-1, 2, C3k2, [512, False]] # 13

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 4], 1, Concat, [1]] # cat backbone P3
  - [-1, 2, C3k2, [256, False]] # 16 (P3/8-small)
  - [-1, 1, ResCBAM, [256]] # 17, ResCBAM-P3

  - [-1, 1, Conv, [256, 3, 2]]
  - [[-1, 13], 1, Concat, [1]] # cat head P4
  - [-1, 2, C3k2, [512, False]] # 20 (P4/16-medium)
  - [-1, 1, ResCBAM, [512]] # 21, ResCBAM-P4

  - [-1, 1, Conv, [512, 3, 2]]
  - [[-1, 10], 1, Concat, [1]] # cat head P5
  - [-1, 2, C3k2, [1024, True]] # 24 (P5/32-large), original P5 neck output

  - [[17, 21, 24], 1, Detect, [nc]] # Detect(ResCBAM-P3, ResCBAM-P4, P5)