# Ultralytics YOLO11 object detection model with GCBlock backbone + CSPStage-lite P4 neck.
#
# WasteSortingv3 ablation:
# - Keeps the GCBlock backbone at P3/P4.
# - Keeps the top-down FPN and P5 bottom-up fusion unchanged.
# - Replaces only the bottom-up P3->P4 PAN fusion block with CSPStageLite.

nc: 5
scales:
  # [depth, width, max_channels]
  n: [0.50, 0.25, 1024]
  s: [0.50, 0.50, 1024]
  m: [0.50, 1.00, 512]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.50, 512]

backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]] # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]] # 1-P2/4
  - [-1, 2, C3k2, [256, False, 0.25]]
  - [-1, 1, Conv, [256, 3, 2]] # 3-P3/8
  - [-1, 2, C3k2, [512, False, 0.25]] # 4-P3/8
  - [-1, 1, GCBlock, [512]] # 5-GC-P3
  - [-1, 1, Conv, [512, 3, 2]] # 6-P4/16
  - [-1, 2, C3k2, [512, True]] # 7-P4/16
  - [-1, 1, GCBlock, [512]] # 8-GC-P4
  - [-1, 1, Conv, [1024, 3, 2]] # 9-P5/32
  - [-1, 2, C3k2, [1024, True]] # 10
  - [-1, 1, SPPF, [1024, 5]] # 11
  - [-1, 2, C2PSA, [1024]] # 12

head:
  # P5 -> P4: original top-down FPN
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 8], 1, Concat, [1]]
  - [-1, 2, C3k2, [512, False]] # 15

  # P4 -> P3: original top-down FPN
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 5], 1, Concat, [1]]
  - [-1, 2, C3k2, [256, False]] # 18 (P3/8-small)

  # P3 -> P4: CSPStage-lite bottom-up PAN, P4-only
  - [-1, 1, Conv, [256, 3, 2]]
  - [[-1, 15], 1, Concat, [1]]
  - [-1, 2, CSPStageLite, [512, False, 1, 0.5]] # 21 (P4/16-medium)

  # P4 -> P5: original bottom-up PAN to protect high-level semantics
  - [-1, 1, Conv, [512, 3, 2]]
  - [[-1, 12], 1, Concat, [1]]
  - [-1, 2, C3k2, [1024, True]] # 24 (P5/32-large)

  - [[18, 21, 24], 1, Detect, [nc]] # Detect(P3, P4, P5)
