# Ultralytics YOLO11 object detection model with P2/4 - P5/32 outputs.
#
# Small-object diagnostic variant for WasteSortingv3:
# - Keeps the YOLO11n backbone and standard Detect head.
# - Adds a P2/4 feature branch in the neck.
# - Uses Detect(P2, P3, P4, P5) to improve recall for small or thin objects.
# - Does not use custom attention/fusion modules, so this can isolate the value
#   of the P2 small-object layer before adding more complex neck changes.

nc: 5
scales:
  # [depth, width, max_channels]
  n: [0.50, 0.25, 1024]
  s: [0.50, 0.50, 1024]
  m: [0.50, 1.00, 512]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.50, 512]

backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]] # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]] # 1-P2/4
  - [-1, 2, C3k2, [256, False, 0.25]] # 2-P2/4
  - [-1, 1, Conv, [256, 3, 2]] # 3-P3/8
  - [-1, 2, C3k2, [512, False, 0.25]] # 4-P3/8
  - [-1, 1, Conv, [512, 3, 2]] # 5-P4/16
  - [-1, 2, C3k2, [512, True]] # 6-P4/16
  - [-1, 1, Conv, [1024, 3, 2]] # 7-P5/32
  - [-1, 2, C3k2, [1024, True]] # 8-P5/32
  - [-1, 1, SPPF, [1024, 5]] # 9
  - [-1, 2, C2PSA, [1024]] # 10

head:
  # Top-down: P5 -> P4
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] # 11
  - [[-1, 6], 1, Concat, [1]] # 12, cat backbone P4
  - [-1, 2, C3k2, [512, False]] # 13, P4 top-down

  # Top-down: P4 -> P3
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] # 14
  - [[-1, 4], 1, Concat, [1]] # 15, cat backbone P3
  - [-1, 2, C3k2, [256, False]] # 16, P3 top-down

  # Top-down: P3 -> P2 small-object branch
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] # 17
  - [[-1, 2], 1, Concat, [1]] # 18, cat backbone P2
  - [-1, 2, C3k2, [128, False]] # 19, P2/4-small

  # Bottom-up: P2 -> P3
  - [-1, 1, Conv, [128, 3, 2]] # 20
  - [[-1, 16], 1, Concat, [1]] # 21, cat head P3
  - [-1, 2, C3k2, [256, False]] # 22, P3/8-small

  # Bottom-up: P3 -> P4
  - [-1, 1, Conv, [256, 3, 2]] # 23
  - [[-1, 13], 1, Concat, [1]] # 24, cat head P4
  - [-1, 2, C3k2, [512, False]] # 25, P4/16-medium

  # Bottom-up: P4 -> P5
  - [-1, 1, Conv, [512, 3, 2]] # 26
  - [[-1, 10], 1, Concat, [1]] # 27, cat backbone P5
  - [-1, 2, C3k2, [1024, True]] # 28, P5/32-large

  - [[19, 22, 25, 28], 1, Detect, [nc]] # Detect(P2, P3, P4, P5)
