# YOLO11n + GRN4 backbone + original PAN/C3k2 neck
# + SAPA-G guided P5-to-P4 and P4-to-P3 upsampling + THead-Lite Direct.
# Ablation scope: only the two top-down upsampling operations differ from
# yolov11_grn4_thead_lite_direct.yaml.

nc: 5
scales:
  n: [0.50, 0.25, 1024]
  s: [0.50, 0.50, 1024]
  m: [0.50, 1.00, 512]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.50, 512]

backbone:
  - [-1, 1, Conv, [64, 3, 2]] # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]] # 1-P2/4
  - [-1, 2, C3k2, [256, False, 0.25]] # 2-P2/4
  - [-1, 1, GRNBlock, [256]] # 3-GRN-P2
  - [-1, 1, Conv, [256, 3, 2]] # 4-P3/8
  - [-1, 2, C3k2, [512, False, 0.25]] # 5-P3/8
  - [-1, 1, GRNBlock, [512]] # 6-GRN-P3
  - [-1, 1, Conv, [512, 3, 2]] # 7-P4/16
  - [-1, 2, C3k2, [512, True]] # 8-P4/16
  - [-1, 1, GRNBlock, [512]] # 9-GRN-P4
  - [-1, 1, Conv, [1024, 3, 2]] # 10-P5/32
  - [-1, 2, C3k2, [1024, True]] # 11-P5/32
  - [-1, 1, GRNBlock, [1024]] # 12-GRN-P5
  - [-1, 1, SPPF, [1024, 5]] # 13
  - [-1, 2, C2PSA, [1024]] # 14-P5/32

head:
  # SAPA-G inputs: high-resolution GRN-P4 guidance first, low-resolution P5 decoder second.
  - [[9, 14], 1, SAPAUpsample, [2, 5, 32, "gate"]] # 15: guided P5 -> P4
  - [[-1, 9], 1, Concat, [1]] # cat GRN-P4
  - [-1, 2, C3k2, [512, False]] # 17-P4/16

  # SAPA-G inputs: high-resolution GRN-P3 guidance first, low-resolution P4 decoder second.
  - [[6, 17], 1, SAPAUpsample, [2, 5, 32, "gate"]] # 18: guided P4 -> P3
  - [[-1, 6], 1, Concat, [1]] # cat GRN-P3
  - [-1, 2, C3k2, [256, False]] # 20-P3/8

  - [-1, 1, Conv, [256, 3, 2]]
  - [[-1, 17], 1, Concat, [1]]
  - [-1, 2, C3k2, [512, False]] # 23-P4/16
  - [-1, 1, Conv, [512, 3, 2]]
  - [[-1, 14], 1, Concat, [1]]
  - [-1, 2, C3k2, [1024, True]] # 26-P5/32
  - [[20, 23, 26], 1, THeadLiteDirectDetect, [nc, 3, 64]]
