# YOLO11n + GRN4 backbone + HyperACE/FullPAD neck-only ablation.

nc: 5
scales:
  n: [0.50, 0.25, 1024]
  s: [0.50, 0.50, 1024]
  m: [0.50, 1.00, 512]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.50, 512]

backbone:
  - [-1, 1, Conv, [64, 3, 2]] # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]] # 1-P2/4
  - [-1, 2, C3k2, [256, False, 0.25]] # 2-P2/4
  - [-1, 1, GRNBlock, [256]] # 3-GRN-P2
  - [-1, 1, Conv, [256, 3, 2]] # 4-P3/8
  - [-1, 2, C3k2, [512, False, 0.25]] # 5-P3/8
  - [-1, 1, GRNBlock, [512]] # 6-GRN-P3
  - [-1, 1, Conv, [512, 3, 2]] # 7-P4/16
  - [-1, 2, C3k2, [512, True]] # 8-P4/16
  - [-1, 1, GRNBlock, [512]] # 9-GRN-P4
  - [-1, 1, Conv, [1024, 3, 2]] # 10-P5/32
  - [-1, 2, C3k2, [1024, True]] # 11-P5/32
  - [-1, 1, GRNBlock, [1024]] # 12-GRN-P5
  - [-1, 1, SPPF, [1024, 5]] # 13
  - [-1, 2, C2PSA, [1024]] # 14

head:
  # Four hyperedges match the nano scaling used by the official YOLOv13 configuration.
  - [[6, 9, 14], 1, HyperACEFullPADNeck, [[256, 512, 1024], 4, 1]] # 15
  - [15, 1, NeckFeatureSelect, [0]] # 16-P3/8
  - [15, 1, NeckFeatureSelect, [1]] # 17-P4/16
  - [15, 1, NeckFeatureSelect, [2]] # 18-P5/32
  - [[16, 17, 18], 1, Detect, [nc]]
