# YOLOv11n + GCBlock(P3/P4/P5) + StarBlock-lite bottom-up Neck

nc: 5
scales:
  # [depth, width, max_channels]
  n: [0.50, 0.25, 1024]
  s: [0.50, 0.50, 1024]
  m: [0.50, 1.00, 512]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.50, 512]

backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]]          # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]]         # 1-P2/4
  - [-1, 2, C3k2, [256, False, 0.25]]  # 2

  - [-1, 1, Conv, [256, 3, 2]]         # 3-P3/8
  - [-1, 2, C3k2, [512, False, 0.25]]  # 4-P3/8
  - [-1, 1, GCBlock, [512]]            # 5-GC-P3

  - [-1, 1, Conv, [512, 3, 2]]         # 6-P4/16
  - [-1, 2, C3k2, [512, True]]         # 7-P4/16
  - [-1, 1, GCBlock, [512]]            # 8-GC-P4

  - [-1, 1, Conv, [1024, 3, 2]]        # 9-P5/32
  - [-1, 2, C3k2, [1024, True]]        # 10
  - [-1, 1, SPPF, [1024, 5]]           # 11
  - [-1, 2, C2PSA, [1024]]             # 12-P5/32
  - [-1, 1, GCBlock, [1024]]           # 13-GC-P5

head:
  # P5 -> P4: top-down FPN, keep original C3k2
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]  # 14
  - [[-1, 8], 1, Concat, [1]]                   # 15 cat GC-P4
  - [-1, 2, C3k2, [512, False]]                 # 16

  # P4 -> P3: top-down FPN, keep original C3k2
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]  # 17
  - [[-1, 5], 1, Concat, [1]]                   # 18 cat GC-P3
  - [-1, 2, C3k2, [256, False]]                 # 19 P3/8

  # P3 -> P4: StarBlock-lite bottom-up PAN
  - [-1, 1, Conv, [256, 3, 2]]                  # 20
  - [[-1, 16], 1, Concat, [1]]                  # 21 cat head P4
  - [-1, 2, C3k2_StarBlockLite, [512, False]]   # 22 P4/16

  # P4 -> P5: StarBlock-lite bottom-up PAN
  - [-1, 1, Conv, [512, 3, 2]]                  # 23
  - [[-1, 13], 1, Concat, [1]]                  # 24 cat GC-P5
  - [-1, 2, C3k2_StarBlockLite, [1024, False]]  # 25 P5/32

  - [[19, 22, 25], 1, Detect, [nc]]             # Detect(P3, P4, P5)