# Ultralytics YOLO11 object detection model with MAFPN-lite neck.
#
# This variant keeps the YOLO11 backbone and Detect head type unchanged.
# Only the neck is modified by adding shallow-assisted feature fusion from P2
# into the P3 path, then reusing P4 features in the bottom-up path.

nc: 5
scales:
  # [depth, width, max_channels]
  n: [0.50, 0.25, 1024]
  s: [0.50, 0.50, 1024]
  m: [0.50, 1.00, 512]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.50, 512]

backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]] # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]] # 1-P2/4
  - [-1, 2, C3k2, [256, False, 0.25]] # 2-P2/4
  - [-1, 1, Conv, [256, 3, 2]] # 3-P3/8
  - [-1, 2, C3k2, [512, False, 0.25]] # 4-P3/8
  - [-1, 1, Conv, [512, 3, 2]] # 5-P4/16
  - [-1, 2, C3k2, [512, True]] # 6-P4/16
  - [-1, 1, Conv, [1024, 3, 2]] # 7-P5/32
  - [-1, 2, C3k2, [1024, True]] # 8-P5/32
  - [-1, 1, SPPF, [1024, 5]] # 9
  - [-1, 2, C2PSA, [1024]] # 10

head:
  # SAF-lite: P2 -> P3 shallow-assisted fusion
  - [2, 1, Conv, [256, 3, 2]] # 11, P2/4 -> P3/8
  - [4, 1, Conv, [256, 1, 1]] # 12, align backbone P3 channels
  - [[11, 12], 1, Concat, [1]] # 13, shallow-assisted P3 concat
  - [-1, 2, C3k2, [256, False]] # 14, SAF-P3

  # Top-down: P5 -> P4
  - [10, 1, nn.Upsample, [None, 2, "nearest"]] # 15
  - [[-1, 6], 1, Concat, [1]] # 16, cat backbone P4
  - [-1, 2, C3k2, [512, False]] # 17, TD-P4

  # Top-down: P4 -> P3 with SAF-P3
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] # 18
  - [[-1, 14], 1, Concat, [1]] # 19, cat SAF-P3
  - [-1, 2, C3k2, [256, False]] # 20, P3/8-small

  # Bottom-up: P3 -> P4 with auxiliary backbone P4 reuse
  - [-1, 1, Conv, [256, 3, 2]] # 21
  - [[-1, 17, 6], 1, Concat, [1]] # 22, AAF-lite P4 concat
  - [-1, 2, C3k2, [512, False]] # 23, P4/16-medium

  # Bottom-up: P4 -> P5
  - [-1, 1, Conv, [512, 3, 2]] # 24
  - [[-1, 10], 1, Concat, [1]] # 25, cat backbone P5
  - [-1, 2, C3k2, [1024, True]] # 26, P5/32-large

  - [[20, 23, 26], 1, Detect, [nc]] # Detect(P3, P4, P5)
